joakimeriksson/cooja-ng/src/arm/nrf52840_soc.c
/*
 * nRF52840 SoC peripheral model.
 *
 * Runs real Contiki-NG nrf52840 firmware AND boots Zephyr OS (the
 * nrf52840dk hello_world prints over UART).  Modelled peripherals:
 *
 *   - CLOCK (0x40000000): HFCLK/LFCLK start-task ↔ event handshake, plus
 *     the HFCLKSTAT/LFCLKSTAT/LFCLKSRC status registers Zephyr's
 *     clock_control_nrf spin-waits on (lfclk_spinwait).
 *   - UART0 legacy window (0x40002000): TXD + EVENTS_TXDRDY (the non-DMA
 *     driver; Contiki uses it natively, Zephyr via a `nordic,nrf-uart`
 *     devicetree overlay — the UARTE EasyDMA path is not modelled).
 *   - RTC0 (0x4000B000, Contiki clock) + RTC1 (0x40011000, Zephyr's
 *     nrf_rtc_timer system clock): counter + COMPARE + TICK/OVRFLW + IRQ.
 *   - RADIO (0x40001000): 802.15.4 TX/RX state machine + EasyDMA frames.
 *   - TIMER0..4, RNG, FICR.
 *
 * Still unmodelled (firmware that needs them will trap; ARM_MMIO_TRACE=1
 * surfaces the first access to each missing peripheral page): GPIO/GPIOTE
 * (writes ignored), NVMC, PPI, SPI/TWI.
 */
#include "nrf52840_soc.h"
#include "arm_cpu.h"
#include "arm_nvic.h"
#include "ieee_802154.h"
#include "nrf_radio_common.h"
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

/* sim_host shims — the host vtable used by off-SoC chip drivers.
 * The dongle has none, but anything that consults plat->host should
 * find a usable now_ns / schedule_ns / cancel. */
static int64_t nrf_host_now_ns(void *cpu) {
    return ((arm_cpu_t *)cpu)->sim_time_ns;
}
static void nrf_host_schedule_ns(void *cpu, cpu_event_t *ev, int64_t fire_ns) {
    arm_schedule_event_ns((arm_cpu_t *)cpu, ev, fire_ns);
}
static void nrf_host_cancel(void *cpu, cpu_event_t *ev) {
    arm_cancel_event((arm_cpu_t *)cpu, ev);
}

/* ============================================================
 * CLOCK (0x40000000)
 *
 * Task offsets:
 *   0x000 TASKS_HFCLKSTART  — write 1 → set EVENTS_HFCLKSTARTED
 *   0x004 TASKS_HFCLKSTOP   — accept (no event)
 *   0x008 TASKS_LFCLKSTART  — write 1 → set EVENTS_LFCLKSTARTED
 *   0x00C TASKS_LFCLKSTOP
 *
 * Event offsets:
 *   0x100 EVENTS_HFCLKSTARTED
 *   0x104 EVENTS_LFCLKSTARTED
 *
 * Real hardware takes a few hundred microseconds to start a crystal;
 * csim flips the event immediately. Firmware that polls is happy;
 * firmware that uses an interrupt would need NVIC wiring (not yet).
 * ============================================================ */
#define NRF_CLOCK_BASE            0x40000000u
#define NRF_CLOCK_SIZE            0x1000u
#define NRF_CLOCK_TASKS_HFCLKSTART 0x000
#define NRF_CLOCK_TASKS_LFCLKSTART 0x008
#define NRF_CLOCK_EVENTS_HFCLKSTARTED 0x100
#define NRF_CLOCK_EVENTS_LFCLKSTARTED 0x104
/* Status / source registers — Zephyr's clock_control_nrf spin-waits on these
 * (lfclk_spinwait polls LFCLKSTAT.STATE); Contiki only used the events. */
#define NRF_CLOCK_HFCLKRUN         0x408
#define NRF_CLOCK_HFCLKSTAT        0x40C
#define NRF_CLOCK_LFCLKRUN         0x414
#define NRF_CLOCK_LFCLKSTAT        0x418
#define NRF_CLOCK_LFCLKSRC         0x518
#define NRF_CLOCK_STAT_STATE       (1u << 16)   /* "clock is running" */

static int nrf_clock_read(void *user_data, uint32_t addr) {
    nrf_clock_state_t *clock = (nrf_clock_state_t *)user_data;
    uint32_t off = addr - NRF_CLOCK_BASE;
    switch (off) {
        case NRF_CLOCK_EVENTS_HFCLKSTARTED: return (int)clock->hfclkstarted;
        case NRF_CLOCK_EVENTS_LFCLKSTARTED: return (int)clock->lfclkstarted;
        case NRF_CLOCK_HFCLKRUN:  return clock->hfclkstarted ? 1 : 0;
        case NRF_CLOCK_HFCLKSTAT:
            /* SRC=XTAL(1) + STATE=running once started. */
            return clock->hfclkstarted ? (int)(NRF_CLOCK_STAT_STATE | 1u) : 0;
        case NRF_CLOCK_LFCLKRUN:  return clock->lfclkstarted ? 1 : 0;
        case NRF_CLOCK_LFCLKSTAT:
            /* Report the configured source as running once started — what
             * Zephyr's lfclk_spinwait waits for (STATE bit + SRC match). */
            return (int)((clock->lfclksrc & 3u) |
                         (clock->lfclkstarted ? NRF_CLOCK_STAT_STATE : 0u));
        case NRF_CLOCK_LFCLKSRC:  return (int)clock->lfclksrc;
        default: return 0;
    }
}

static void nrf_clock_write(void *user_data, uint32_t addr, uint32_t value) {
    nrf_clock_state_t *clock = (nrf_clock_state_t *)user_data;
    uint32_t off = addr - NRF_CLOCK_BASE;
    switch (off) {
        case NRF_CLOCK_TASKS_HFCLKSTART:
            if (value == 1) clock->hfclkstarted = 1;
            break;
        case NRF_CLOCK_TASKS_LFCLKSTART:
            if (value == 1) clock->lfclkstarted = 1;
            break;
        case NRF_CLOCK_EVENTS_HFCLKSTARTED:
            clock->hfclkstarted = value & 1;
            break;
        case NRF_CLOCK_EVENTS_LFCLKSTARTED:
            clock->lfclkstarted = value & 1;
            break;
        case NRF_CLOCK_LFCLKSRC:
            clock->lfclksrc = value;
            break;
        default: break;
    }
}

/* ============================================================
 * UART0 legacy register window (0x40002000)
 *
 *   0x11C EVENTS_TXDRDY  — TX byte transmitted and ready for next
 *   0x500 ENABLE         — write 4 to enable in legacy UART mode
 *   0x51C TXD            — write byte to transmit
 *
 * (PSEL.TXD/RXD/CTS/RTS, BAUDRATE, CONFIG: writes accepted, no
 * behaviour. Reads return 0.)
 *
 * UARTE EasyDMA path (TXD.PTR / TXD.MAXCNT / TASKS_STARTTX) is NOT
 * modelled — Contiki uses the legacy API with NRF52840_NATIVE_USB=0.
 * ============================================================ */
#define NRF_UART0_BASE             0x40002000u
#define NRF_UART0_SIZE             0x1000u
#define NRF_UART_EVENTS_TXDRDY     0x11C
#define NRF_UART_ENABLE            0x500
#define NRF_UART_TXD               0x51C
/* UARTE EasyDMA TX (shares the 0x40002000 page; stock Zephyr console path). */
#define NRF_UARTE_IRQ              2
#define NRF_UARTE_TASKS_STARTTX    0x008
#define NRF_UARTE_TASKS_STOPTX     0x00C
#define NRF_UARTE_EVENTS_ENDTX     0x120
#define NRF_UARTE_EVENTS_TXSTARTED 0x150
#define NRF_UARTE_EVENTS_TXSTOPPED 0x158
#define NRF_UARTE_INTENSET         0x304
#define NRF_UARTE_INTENCLR         0x308
#define NRF_UARTE_TXD_PTR          0x544
#define NRF_UARTE_TXD_MAXCNT       0x548
#define NRF_UARTE_TXD_AMOUNT       0x54C
#define NRF_UARTE_INT_ENDTX        (1u << 8)

static int nrf_uart_read(void *user_data, uint32_t addr) {
    nrf_uart_state_t *uart = (nrf_uart_state_t *)user_data;
    uint32_t off = addr - NRF_UART0_BASE;
    switch (off) {
        case NRF_UART_EVENTS_TXDRDY:     return (int)uart->txdrdy;
        case NRF_UART_ENABLE:            return (int)uart->enable;
        /* UARTE EasyDMA TX read-backs. */
        case NRF_UARTE_EVENTS_ENDTX:     return (int)uart->endtx;
        case NRF_UARTE_EVENTS_TXSTARTED: return (int)uart->txstarted;
        case NRF_UARTE_EVENTS_TXSTOPPED: return (int)uart->txstopped;
        case NRF_UARTE_TXD_PTR:          return (int)uart->txd_ptr;
        case NRF_UARTE_TXD_MAXCNT:       return (int)uart->txd_maxcnt;
        case NRF_UARTE_TXD_AMOUNT:       return (int)uart->txd_amount;
        case NRF_UARTE_INTENSET:
        case NRF_UARTE_INTENCLR:         return (int)uart->intenset;
        default: return 0;
    }
}

/* UARTE TASKS_STARTTX: DMA `maxcnt` bytes from RAM at `txd_ptr` straight out
 * the console, then latch ENDTX/TXSTARTED (and raise the IRQ if enabled).
 * Instant transfer — no per-byte baud timing, same lenience as the legacy
 * path. */
static void uarte_start_tx(nrf_uart_state_t *uart) {
    nrf52840_soc_t *soc = (nrf52840_soc_t *)uart->soc;
    arm_cpu_t *cpu = &soc->plat->cpu;
    uint32_t n = uart->txd_maxcnt;
    if (n > 4096) n = 4096;                 /* sanity bound */
    for (uint32_t i = 0; i < n; i++) {
        uint8_t b = arm_read8(cpu, uart->txd_ptr + i);
        if (uart->tx_cb) uart->tx_cb(uart->tx_user, b);
    }
    uart->txd_amount = n;
    uart->txstarted  = 1;
    uart->endtx      = 1;                    /* poll_out spins on this */
    /* csim's transfer is instantaneous, so TX is inactive the moment STARTTX
     * returns — what the driver's ENDTX→STOPTX PPI link would yield (csim
     * doesn't model PPI).  The init/poll path then exits its TXSTOPPED spin. */
    uart->txstopped  = 1;
    if ((uart->intenset & NRF_UARTE_INT_ENDTX) && soc->plat->cpu.nvic)
        arm_nvic_set_pending((arm_nvic_t *)soc->plat->cpu.nvic, uart->irq_num);
}

static void nrf_uart_write(void *user_data, uint32_t addr, uint32_t value) {
    nrf_uart_state_t *uart = (nrf_uart_state_t *)user_data;
    uint32_t off = addr - NRF_UART0_BASE;
    switch (off) {
        case NRF_UART_TXD:
            /* Forward to console callback if installed. Set TXDRDY so
             * the firmware's spin-loop exits on the next read. */
            if (uart->tx_cb)
                uart->tx_cb(uart->tx_user, (uint8_t)(value & 0xFF));
            uart->txdrdy = 1;
            break;
        case NRF_UART_EVENTS_TXDRDY:
            /* Firmware writes 0 to ack the event after consuming it. */
            uart->txdrdy = value & 1;
            break;
        case NRF_UART_ENABLE:
            uart->enable = value;
            break;
        /* UARTE EasyDMA TX path. */
        case NRF_UARTE_TASKS_STARTTX:  if (value == 1) uarte_start_tx(uart); break;
        case NRF_UARTE_TASKS_STOPTX:   if (value == 1) uart->txstopped = 1; break;
        case NRF_UARTE_TXD_PTR:        uart->txd_ptr    = value; break;
        case NRF_UARTE_TXD_MAXCNT:     uart->txd_maxcnt = value; break;
        case NRF_UARTE_EVENTS_ENDTX:   uart->endtx      = value & 1; break;
        case NRF_UARTE_EVENTS_TXSTARTED: uart->txstarted = value & 1; break;
        case NRF_UARTE_EVENTS_TXSTOPPED: uart->txstopped = value & 1; break;
        case NRF_UARTE_INTENSET:       uart->intenset |= value; break;
        case NRF_UARTE_INTENCLR:       uart->intenset &= ~value; break;
        default: break;
    }
}

/* ============================================================
 * RTC0 (0x4000B000)
 *
 * 24-bit counter clocked from LFCLK (32 768 Hz) via 12-bit PRESCALER.
 * Real tick period = (PRESCALER + 1) / 32 768 seconds.
 *
 * Contiki's clock_init enables TICK interrupts to drive the etimer
 * subsystem. Our model schedules a recurring TICK event on the ARM
 * event queue: when it fires we latch EVENTS_TICK and (if INTENSET.TICK
 * is set) raise the RTC0 NVIC IRQ. The CPU's existing WFI handling
 * advances simulated time to the next event automatically, so
 * `wfi`-based idle loops resume on the tick.
 * ============================================================ */
#define NRF_RTC0_BASE          0x4000B000u
#define NRF_RTC0_SIZE          0x1000u
#define NRF_RTC0_IRQ           11
/* RTC1 — same peripheral, used by Zephyr's nrf_rtc_timer as the system clock. */
#define NRF_RTC1_BASE          0x40011000u
#define NRF_RTC1_SIZE          0x1000u
#define NRF_RTC1_IRQ           17
#define NRF_LFCLK_HZ           32768u

