joakimeriksson/cooja-ng/src/arm/nrf52840_soc.c
#define RTC_TASKS_START        0x000
#define RTC_TASKS_STOP         0x004
#define RTC_TASKS_CLEAR        0x008
#define RTC_TASKS_TRIGOVRFLW   0x00C
#define RTC_EVENTS_TICK        0x100
#define RTC_EVENTS_OVRFLW      0x104
#define RTC_EVENTS_COMPARE_0   0x140
#define RTC_INTENSET           0x304
#define RTC_INTENCLR           0x308
#define RTC_EVTENSET           0x340
#define RTC_EVTENCLR           0x344
#define RTC_COUNTER            0x504
#define RTC_PRESCALER          0x508
#define RTC_CC_0               0x540

#define RTC_INT_TICK           (1u << 0)
#define RTC_INT_OVRFLW         (1u << 1)
#define RTC_INT_COMPARE_0      (1u << 16)

static uint32_t rtc_compute_counter(const nrf_rtc_state_t *rtc, int64_t now_cycles) {
    if (!rtc->running || rtc->tick_period_cycles == 0)
        return rtc->counter_at_anchor;
    int64_t elapsed = now_cycles - rtc->counter_anchor_cycles;
    if (elapsed < 0) elapsed = 0;
    uint64_t ticks = (uint64_t)elapsed / rtc->tick_period_cycles;
    return (rtc->counter_at_anchor + (uint32_t)ticks) & 0xFFFFFFu;
}

static uint32_t rtc_period_for_prescaler(uint32_t prescaler, uint32_t cpu_freq_hz) {
    /* tick_rate = LFCLK / (prescaler+1).  cycles_per_tick = cpu_freq / tick_rate. */
    uint64_t denom = (uint64_t)NRF_LFCLK_HZ;
    uint64_t num   = (uint64_t)cpu_freq_hz * (uint64_t)(prescaler + 1);
    if (denom == 0) return 1;
    uint64_t period = num / denom;
    if (period == 0) period = 1;
    return (uint32_t)period;
}

static void rtc_tick_event_cb(void *user_data, cpu_event_t *event) {
    nrf_rtc_state_t *rtc = (nrf_rtc_state_t *)user_data;
    nrf52840_soc_t *soc = (nrf52840_soc_t *)rtc->soc;
    arm_platform_t *plat = soc->plat;
    if (!plat || !rtc->running) return;

    /* Counter advances by one tick each event firing. Re-anchor so reads
     * stay consistent without divisions for callers that read COUNTER
     * between ticks. */
    rtc->counter_at_anchor = (rtc->counter_at_anchor + 1) & 0xFFFFFFu;
    rtc->counter_anchor_cycles = event->fire_cycle;

    rtc->evt_tick = 1;
    if (rtc->counter_at_anchor == 0) rtc->evt_ovrflw = 1;

    /* Compare events */
    for (int i = 0; i < 4; i++) {
        if (rtc->cc[i] == rtc->counter_at_anchor)
            rtc->evt_compare[i] = 1;
    }

    /* Raise IRQ if any enabled event is now latched. */
    bool fire = false;
    if ((rtc->intenset & RTC_INT_TICK)   && rtc->evt_tick)   fire = true;
    if ((rtc->intenset & RTC_INT_OVRFLW) && rtc->evt_ovrflw) fire = true;
    for (int i = 0; i < 4; i++)
        if ((rtc->intenset & (RTC_INT_COMPARE_0 << i)) && rtc->evt_compare[i])
            fire = true;
    if (fire && plat->cpu.nvic)
        arm_nvic_set_pending((arm_nvic_t *)plat->cpu.nvic, rtc->irq_num);

    /* Reschedule next tick. */
    int64_t next = event->fire_cycle + (int64_t)rtc->tick_period_cycles;
    arm_schedule_event(&plat->cpu, (arm_event_t *)rtc->tick_event, next);
}

static void rtc_start(nrf_rtc_state_t *rtc, arm_platform_t *plat) {
    if (rtc->running) return;
    rtc->running = true;
    rtc->tick_period_cycles =
        rtc_period_for_prescaler(rtc->prescaler, plat->cpu.cpu_freq_hz);
    rtc->counter_anchor_cycles = (int64_t)plat->cpu.cycles;
    arm_schedule_event(&plat->cpu, (arm_event_t *)rtc->tick_event,
                       (int64_t)plat->cpu.cycles + (int64_t)rtc->tick_period_cycles);
}

static void rtc_stop(nrf_rtc_state_t *rtc, arm_platform_t *plat) {
    if (!rtc->running) return;
    /* Snapshot current counter so further reads return the right value. */
    rtc->counter_at_anchor = rtc_compute_counter(rtc, (int64_t)plat->cpu.cycles);
    rtc->counter_anchor_cycles = (int64_t)plat->cpu.cycles;
    rtc->running = false;
    arm_cancel_event(&plat->cpu, (arm_event_t *)rtc->tick_event);
}

static int nrf_rtc_read(void *user_data, uint32_t addr) {
    nrf_rtc_state_t *rtc = (nrf_rtc_state_t *)user_data;
    arm_platform_t *plat = ((nrf52840_soc_t *)rtc->soc)->plat;
    uint32_t off = addr - rtc->base;
    switch (off) {
        case RTC_EVENTS_TICK:    return (int)rtc->evt_tick;
        case RTC_EVENTS_OVRFLW:  return (int)rtc->evt_ovrflw;
        case RTC_EVENTS_COMPARE_0:
        case RTC_EVENTS_COMPARE_0 + 4:
        case RTC_EVENTS_COMPARE_0 + 8:
        case RTC_EVENTS_COMPARE_0 + 12:
            return (int)rtc->evt_compare[(off - RTC_EVENTS_COMPARE_0) / 4];
        case RTC_INTENSET: case RTC_INTENCLR: return (int)rtc->intenset;
        case RTC_EVTENSET: case RTC_EVTENCLR: return (int)rtc->evtenset;
        case RTC_COUNTER:
            return (int)rtc_compute_counter(rtc, (int64_t)plat->cpu.cycles);
        case RTC_PRESCALER: return (int)rtc->prescaler;
        case RTC_CC_0:      case RTC_CC_0 + 4:
        case RTC_CC_0 + 8:  case RTC_CC_0 + 12:
            return (int)rtc->cc[(off - RTC_CC_0) / 4];
        default: return 0;
    }
}

static void nrf_rtc_write(void *user_data, uint32_t addr, uint32_t value) {
    nrf_rtc_state_t *rtc = (nrf_rtc_state_t *)user_data;
    arm_platform_t *plat = ((nrf52840_soc_t *)rtc->soc)->plat;
    uint32_t off = addr - rtc->base;
    switch (off) {
        case RTC_TASKS_START: if (value == 1) rtc_start(rtc, plat); break;
        case RTC_TASKS_STOP:  if (value == 1) rtc_stop(rtc, plat);  break;
        case RTC_TASKS_CLEAR:
            if (value == 1) {
                rtc->counter_at_anchor = 0;
                rtc->counter_anchor_cycles = (int64_t)plat->cpu.cycles;
            }
            break;
        case RTC_TASKS_TRIGOVRFLW:
            if (value == 1) {
                rtc->counter_at_anchor = 0xFFFFF0;
                rtc->counter_anchor_cycles = (int64_t)plat->cpu.cycles;
            }
            break;
        case RTC_EVENTS_TICK:    rtc->evt_tick = value & 1; break;
        case RTC_EVENTS_OVRFLW:  rtc->evt_ovrflw = value & 1; break;
        case RTC_EVENTS_COMPARE_0:
        case RTC_EVENTS_COMPARE_0 + 4:
        case RTC_EVENTS_COMPARE_0 + 8:
        case RTC_EVENTS_COMPARE_0 + 12:
            rtc->evt_compare[(off - RTC_EVENTS_COMPARE_0) / 4] = value & 1;
            break;
        case RTC_INTENSET: rtc->intenset |= value; break;
        case RTC_INTENCLR: rtc->intenset &= ~value; break;
        case RTC_EVTENSET: rtc->evtenset |= value; break;
        case RTC_EVTENCLR: rtc->evtenset &= ~value; break;
        case RTC_PRESCALER:
            rtc->prescaler = value & 0xFFF;
            if (rtc->running)
                rtc->tick_period_cycles =
                    rtc_period_for_prescaler(rtc->prescaler, plat->cpu.cpu_freq_hz);
            break;
        case RTC_CC_0:      case RTC_CC_0 + 4:
        case RTC_CC_0 + 8:  case RTC_CC_0 + 12:
            rtc->cc[(off - RTC_CC_0) / 4] = value & 0xFFFFFFu;
            break;
        default: break;
    }
}

/* ============================================================
 * RADIO (0x40001000) — first cut
 *
 * Models the state machine + tasks/events/SHORTS that the Contiki
 * nrf52840-ieee driver busy-waits on, but does NOT yet move frame
 * data through PACKETPTR. TX bytes are dropped; RX never fires END
 * from external data. That keeps the firmware's TX/RX paths
 * progressing without spin-locking; multinode delivery comes when we
 * wire RX into radio_medium.
 * ============================================================ */
#define NRF_RADIO_BASE   0x40001000u
#define NRF_RADIO_SIZE   0x1000u
#define NRF_RADIO_IRQ    1

/* Tasks */
#define RADIO_TASKS_TXEN          0x000
#define RADIO_TASKS_RXEN          0x004
#define RADIO_TASKS_START         0x008
#define RADIO_TASKS_STOP          0x00C
#define RADIO_TASKS_DISABLE       0x010
#define RADIO_TASKS_RSSISTART     0x014
#define RADIO_TASKS_RSSISTOP      0x018
#define RADIO_TASKS_BCSTART       0x01C
#define RADIO_TASKS_BCSTOP        0x020
#define RADIO_TASKS_EDSTART       0x024
#define RADIO_TASKS_EDSTOP        0x028
#define RADIO_TASKS_CCASTART      0x02C
#define RADIO_TASKS_CCASTOP       0x030

