joakimeriksson/cooja-ng/src/arm/nrf52840_soc.c
/* Emit the on-air byte sequence (4×preamble + SFD + PHR + payload + CRC)
 * by reading the buffer at PACKETPTR.  Called when the radio enters TX
 * state via TASKS_START.  Body lives in nrf_radio_common — shared with
 * nrf54l15 RADIO. */
static void radio_emit_tx(nrf52840_soc_t *soc) {
    nrf_radio_emit_ieee802154_frame(&soc->plat->cpu, soc->radio.packetptr,
                                     soc->radio_tx_cb, soc->radio_tx_user);
}

void nrf_radio_set_tx_listener(nrf52840_soc_t *soc, nrf_radio_tx_listener_t cb, void *user_data) {
    soc->radio_tx_cb = cb;
    soc->radio_tx_user = user_data;
}

/* Push a single on-air byte into the receiver. Frames bytes through the
 * preamble/SFD/PHR/payload state machine, writes accepted bytes into
 * the PACKETPTR-pointed RAM buffer, and fires FRAMESTART/CRCOK/END
 * events on completion. Called by the multinode harness when the medium
 * delivers a byte to this node. */
void nrf_radio_receive_byte(nrf52840_soc_t *soc, uint8_t byte) {
    nrf_radio_state_t *r = &soc->radio;
    /* Outside RX: buffer the byte for replay on next RX entry.  This
     * catches auto-ACK bytes that arrive 192 µs after our own TX,
     * before the driver has finished the TXIDLE → DISABLED → RXEN →
     * RXIDLE → RX state walk.  Buffer is cleared on TX entry so we
     * never carry stale bytes across a TX cycle. */
    if (r->state != NRF_RADIO_STATE_RX) {
        if (r->rx_incoming_len < (int)sizeof(r->rx_incoming))
            r->rx_incoming[r->rx_incoming_len++] = byte;
        return;
    }
    arm_cpu_t *cpu = &soc->plat->cpu;
    /* Bounds-check PACKETPTR — must point into SRAM. */
    if (r->packetptr < cpu->sram_base || r->packetptr + 128 > cpu->sram_end)
        return;

    switch (r->rx_phase) {
        case NRF_RX_WAIT_PREAMBLE:
            if (byte == IEEE802154_PREAMBLE_BYTE)
                r->rx_phase = NRF_RX_WAIT_SFD;
            break;
        case NRF_RX_WAIT_SFD:
            if (byte == IEEE802154_SFD) {
                r->rx_phase = NRF_RX_READ_PHR;
                radio_event(soc, &r->evt_address,    RADIO_INT_ADDRESS);
                radio_event(soc, &r->evt_framestart, RADIO_INT_FRAMESTART);
            } else if (byte != IEEE802154_PREAMBLE_BYTE) {
                /* Stray byte — restart preamble search. */
                r->rx_phase = NRF_RX_WAIT_PREAMBLE;
            }
            break;
        case NRF_RX_READ_PHR:
            if (byte < 2 || byte > 127) {
                r->rx_phase = NRF_RX_WAIT_PREAMBLE;
                break;
            }
            arm_write8(cpu, r->packetptr, byte);
            r->rx_remaining = byte;          /* PHR includes 2 FCS bytes */
            r->rx_offset    = 1;
            r->rx_phase     = NRF_RX_READ_PAYLOAD;
            break;
        case NRF_RX_READ_PAYLOAD:
            arm_write8(cpu, r->packetptr + (uint32_t)r->rx_offset, byte);
            r->rx_offset++;
            r->rx_remaining--;
            if (r->rx_remaining == 0) {
                /* Frame complete. Always treat as CRC-OK for now —
                 * generators sign their own CRCs and the medium drops
                 * collided bytes already. */
                radio_event(soc, &r->evt_payload,  RADIO_INT_PAYLOAD);
                radio_event(soc, &r->evt_end,      RADIO_INT_END);
                radio_event(soc, &r->evt_phyend,   0);
                radio_event(soc, &r->evt_crcok,    RADIO_INT_CRCOK);

                /* Hardware-style auto-ACK for unicast Data frames that
                 * have the ACK_REQUEST bit set. Real nRF52840 silicon
                 * achieves sub-200 µs ACK turnaround via PPI + TIMER +
                 * SHORTS choreography (set up by Nordic's 802.15.4
                 * driver). The Contiki nrf driver leaves that path
                 * unconfigured and relies on CSMA's software ACK
                 * (`CSMA_SEND_SOFT_ACK`), but csim's tick granularity
                 * makes the software path arrive after the sender's
                 * CSMA_ACK_WAIT_TIME — driving a retx storm that's
                 * pure simulator artefact.  Emit the ACK synchronously
                 * inside the chip model, same convention as cc2538
                 * (cc2538_rfcore.c). The firmware's later software
                 * ACK arrives as a duplicate and is harmlessly dropped
                 * at the sender (already acked, seqno already cleared).
                 *
                 * Layout in PACKETPTR: [PHR][FCF0][FCF1][DSN][...].
                 * Per IEEE 802.15.4 FCF: bit 0:2 = frame type, bit 5 =
                 * ACK_REQUEST. Broadcast frames never set ACK_REQUEST. */
                if (soc->radio_tx_cb && r->rx_offset > 4) {
                    uint8_t fcf0       = arm_read8(cpu, r->packetptr + 1);
                    uint8_t dsn        = arm_read8(cpu, r->packetptr + 3);
                    int     frame_type = fcf0 & 0x07;
                    int     ack_req    = (fcf0 >> 5) & 1;
                    if (frame_type == 0x1 /* Data */ && ack_req) {
                        uint8_t ack_fcf0 = 0x02; /* frame type = ACK */
                        uint8_t ack_fcf1 = 0x00;
                        uint16_t crc = 0;
                        crc = nrf_crc_add(crc, ack_fcf0);
                        crc = nrf_crc_add(crc, ack_fcf1);
                        crc = nrf_crc_add(crc, dsn);
                        nrf_radio_tx_listener_t cb = soc->radio_tx_cb;
                        void *ud                   = soc->radio_tx_user;
                        for (int i = 0; i < IEEE802154_PREAMBLE_LEN; i++)
                            cb(ud, IEEE802154_PREAMBLE_BYTE);
                        cb(ud, IEEE802154_SFD);
                        cb(ud, 5);              /* PHR: FCF(2)+DSN(1)+FCS(2) */
                        cb(ud, ack_fcf0);
                        cb(ud, ack_fcf1);
                        cb(ud, dsn);
                        cb(ud, (uint8_t)(crc & 0xFF));
                        cb(ud, (uint8_t)((crc >> 8) & 0xFF));
                    }
                }

                if (getenv("NRF_RX_TRACE")) {
                    fprintf(stderr, "[nrf-rx] frame off=%d phr=", r->rx_offset);
                    int dump = r->rx_offset > 24 ? 24 : r->rx_offset;
                    for (int i = 0; i < dump; i++)
                        fprintf(stderr, "%02x ", arm_read8(cpu, r->packetptr + (uint32_t)i));
                    fprintf(stderr, "\n");
                }
                /* Driver typically transitions back to RXIDLE via END
                 * processing; mirror that to drain the parser. */
                r->state    = NRF_RADIO_STATE_RXIDLE;
                r->rx_phase = NRF_RX_WAIT_PREAMBLE;
                radio_apply_shorts_after_event(soc, SHORT_END_DISABLE);
            }
            break;
    }
}

/* ============================================================
 * RNG (0x4000D000)
 *
 * Tiny PRNG-backed model. TASKS_START sets EVENTS_VALRDY immediately;
 * VALUE returns the next byte from a per-node xorshift32 stream.
 * Contiki uses this for CSMA backoff and RPL DAG-ID seeding.
 * ============================================================ */
#define NRF_RNG_BASE              0x4000D000u
#define NRF_RNG_TASKS_START       0x000
#define NRF_RNG_TASKS_STOP        0x004
#define NRF_RNG_EVENTS_VALRDY     0x100
#define NRF_RNG_SHORTS            0x200
#define NRF_RNG_INTENSET          0x304
#define NRF_RNG_INTENCLR          0x308
#define NRF_RNG_CONFIG            0x504
#define NRF_RNG_VALUE             0x508

static uint8_t rng_next(nrf_rng_state_t *rng) {
    uint32_t s = rng->prng_state ? rng->prng_state : 0x12345678u;
    s ^= s << 13; s ^= s >> 17; s ^= s << 5;
    rng->prng_state = s;
    return (uint8_t)(s & 0xFF);
}

static int nrf_rng_read(void *user_data, uint32_t addr) {
    nrf_rng_state_t *rng = (nrf_rng_state_t *)user_data;
    uint32_t off = addr - NRF_RNG_BASE;
    switch (off) {
        case NRF_RNG_EVENTS_VALRDY: return (int)rng->evt_valrdy;
        case NRF_RNG_INTENSET:
        case NRF_RNG_INTENCLR:      return (int)rng->intenset;
        case NRF_RNG_SHORTS:        return (int)rng->shorts;
        case NRF_RNG_VALUE:         return (int)rng_next(rng);
        default: return 0;
    }
}

