joakimeriksson/cooja-ng/src/arm/nrf52840_soc.c
static void nrf_rng_write(void *user_data, uint32_t addr, uint32_t value) {
    nrf_rng_state_t *rng = (nrf_rng_state_t *)user_data;
    uint32_t off = addr - NRF_RNG_BASE;
    switch (off) {
        case NRF_RNG_TASKS_START:
            if (value == 1) { rng->running = true; rng->evt_valrdy = 1; }
            break;
        case NRF_RNG_TASKS_STOP:
            if (value == 1) rng->running = false;
            break;
        case NRF_RNG_EVENTS_VALRDY:
            /* Firmware acks VALRDY by writing 0.  If the RNG is still running,
             * immediately re-set it — our PRNG delivers bytes instantly. */
            rng->evt_valrdy = (value & 1) ? 1 : (rng->running ? 1 : 0);
            break;
        case NRF_RNG_SHORTS:        rng->shorts     = value;     break;
        case NRF_RNG_INTENSET:      rng->intenset  |= value;     break;
        case NRF_RNG_INTENCLR:      rng->intenset  &= ~value;    break;
        default: break;
    }
}

/* ============================================================
 * FICR at 0x10000000 — only DEVICEADDR pair is useful here.
 *
 * Per nRF52840 PS, FICR is in the same 0x10000000 page as UICR;
 * we expose a 4 KiB window. DEVICEADDR[0] = 0xA4, DEVICEADDR[1] = 0xA8.
 * ============================================================ */
#define NRF_FICR_BASE        0x10000000u
#define NRF_FICR_DEVICEADDR0 0xA4
#define NRF_FICR_DEVICEADDR1 0xA8
/* Other commonly-read FICR fields we return useful constants for. */
#define NRF_FICR_CODEPAGESIZE 0x10
#define NRF_FICR_CODESIZE     0x14
#define NRF_FICR_DEVICEID0    0x60
#define NRF_FICR_DEVICEID1    0x64
#define NRF_FICR_DEVICEADDRTYPE 0xA0

static int nrf_ficr_read(void *user_data, uint32_t addr) {
    nrf_ficr_state_t *ficr = (nrf_ficr_state_t *)user_data;
    uint32_t off = addr - NRF_FICR_BASE;
    switch (off) {
        case NRF_FICR_CODEPAGESIZE:    return 4096;            /* 4 KiB pages */
        case NRF_FICR_CODESIZE:        return 256;             /* 256 pages → 1 MiB */
        case NRF_FICR_DEVICEADDRTYPE:  return 1;               /* random-static */
        case NRF_FICR_DEVICEADDR0:     return (int)ficr->deviceaddr0;
        case NRF_FICR_DEVICEADDR1:     return (int)ficr->deviceaddr1;
        case NRF_FICR_DEVICEID0:       return (int)ficr->deviceaddr0;
        case NRF_FICR_DEVICEID1:       return (int)ficr->deviceaddr1;
        default: return 0xFFFFFFFF;     /* erased flash */
    }
}

static void nrf_ficr_write(void *user_data, uint32_t addr, uint32_t value) {
    /* FICR is read-only on real hardware. Allow writes from the
     * harness via direct struct access; the firmware never writes here. */
    (void)user_data; (void)addr; (void)value;
}

/* ============================================================
 * TIMER0..4 — minimum for rtimer_arch_now()
 *
 * 16 MHz base clock, scaled by 2^PRESCALER. Counter increments
 * lazily on read; TASKS_CAPTURE[i] latches into CC[i].
 * ============================================================ */
#define TIMER_TASKS_START      0x000
#define TIMER_TASKS_STOP       0x004
#define TIMER_TASKS_COUNT      0x008
#define TIMER_TASKS_CLEAR      0x00C
#define TIMER_TASKS_SHUTDOWN   0x010
#define TIMER_TASKS_CAPTURE_0  0x040  /* +4 each, up to CAPTURE_5 */
#define TIMER_EVENTS_COMPARE_0 0x140  /* +4 each */
#define TIMER_SHORTS           0x200
#define TIMER_INTENSET         0x304
#define TIMER_INTENCLR         0x308
#define TIMER_MODE             0x504
#define TIMER_BITMODE          0x508
#define TIMER_PRESCALER        0x510
#define TIMER_CC_0             0x540  /* +4 each, up to CC_5 */

#define TIMER_BASE_HZ          16000000u

static uint32_t timer_bit_mask(uint32_t bitmode) {
    switch (bitmode) {
        case 0: return 0xFFFFu;        /* 16-bit */
        case 1: return 0xFFu;          /* 8-bit */
        case 2: return 0xFFFFFFu;      /* 24-bit */
        case 3: default: return 0xFFFFFFFFu;  /* 32-bit */
    }
}

static uint32_t timer_compute_counter(const nrf_timer_state_t *t, int64_t now_cycles, uint32_t cpu_freq_hz) {
    if (!t->running) return t->counter_at_start;
    int64_t elapsed = now_cycles - t->start_cycles;
    if (elapsed < 0) elapsed = 0;
    /* tick_rate_hz = TIMER_BASE_HZ >> prescaler */
    uint64_t tick_hz = (uint64_t)TIMER_BASE_HZ >> t->prescaler;
    if (tick_hz == 0) tick_hz = 1;
    /* ticks = elapsed * tick_hz / cpu_freq_hz */
    uint64_t ticks = ((uint64_t)elapsed * tick_hz) / (uint64_t)cpu_freq_hz;
    return (t->counter_at_start + (uint32_t)ticks) & timer_bit_mask(t->bitmode);
}

static int nrf_timer_read(void *user_data, uint32_t addr) {
    nrf_timer_state_t *t = (nrf_timer_state_t *)user_data;
    uint32_t off = addr - t->base;
    if (off >= TIMER_EVENTS_COMPARE_0 && off < TIMER_EVENTS_COMPARE_0 + 6 * 4)
        return (int)t->evt_compare[(off - TIMER_EVENTS_COMPARE_0) / 4];
    if (off >= TIMER_CC_0 && off < TIMER_CC_0 + 6 * 4)
        return (int)t->cc[(off - TIMER_CC_0) / 4];
    switch (off) {
        case TIMER_SHORTS:    return (int)t->shorts;
        case TIMER_INTENSET:
        case TIMER_INTENCLR:  return (int)t->intenset;
        case TIMER_MODE:      return (int)t->mode;
        case TIMER_BITMODE:   return (int)t->bitmode;
        case TIMER_PRESCALER: return (int)t->prescaler;
        default: return 0;
    }
}

static void nrf_timer_write(void *user_data, uint32_t addr, uint32_t value) {
    nrf_timer_state_t *t = (nrf_timer_state_t *)user_data;
    arm_cpu_t *cpu = &t->soc->plat->cpu;
    uint32_t off = addr - t->base;

    if (off >= TIMER_TASKS_CAPTURE_0 && off < TIMER_TASKS_CAPTURE_0 + 6 * 4) {
        if (value == 1) {
            int i = (off - TIMER_TASKS_CAPTURE_0) / 4;
            t->cc[i] = timer_compute_counter(t, (int64_t)cpu->cycles, cpu->cpu_freq_hz);
        }
        return;
    }
    if (off >= TIMER_EVENTS_COMPARE_0 && off < TIMER_EVENTS_COMPARE_0 + 6 * 4) {
        t->evt_compare[(off - TIMER_EVENTS_COMPARE_0) / 4] = value & 1;
        return;
    }
    if (off >= TIMER_CC_0 && off < TIMER_CC_0 + 6 * 4) {
        t->cc[(off - TIMER_CC_0) / 4] = value;
        return;
    }
    switch (off) {
        case TIMER_TASKS_START:
            if (value == 1 && !t->running) {
                t->counter_at_start = timer_compute_counter(t, (int64_t)cpu->cycles, cpu->cpu_freq_hz);
                t->start_cycles = (int64_t)cpu->cycles;
                t->running = true;
            }
            break;
        case TIMER_TASKS_STOP:
        case TIMER_TASKS_SHUTDOWN:
            if (value == 1 && t->running) {
                t->counter_at_start = timer_compute_counter(t, (int64_t)cpu->cycles, cpu->cpu_freq_hz);
                t->start_cycles = (int64_t)cpu->cycles;
                t->running = false;
            }
            break;
        case TIMER_TASKS_CLEAR:
            if (value == 1) {
                t->counter_at_start = 0;
                t->start_cycles = (int64_t)cpu->cycles;
            }
            break;
        case TIMER_SHORTS:    t->shorts    = value; break;
        case TIMER_INTENSET:  t->intenset |= value; break;
        case TIMER_INTENCLR:  t->intenset &= ~value; break;
        case TIMER_MODE:      t->mode      = value & 3; break;
        case TIMER_BITMODE:   t->bitmode   = value & 3; break;
        case TIMER_PRESCALER: t->prescaler = value & 0xF; break;
        default: break;
    }
}

/* ============================================================
 * SoC lifecycle
 * ============================================================ */

static void nrf52840_soc_init(arm_platform_t *plat) {
    nrf52840_soc_t *soc = (nrf52840_soc_t *)calloc(1, sizeof(*soc));
    plat->soc = soc;
    soc->plat = plat;

