joakimeriksson/cooja-ng/src/arm/nrf52840_soc.c
    /* Honour the platform's VTOR override (board-specific: DK = 0x0,
     * Dongle = 0x1000 due to the Open Bootloader). Falls back to the
     * SoC config's vtor_default if the platform leaves it 0. */
    if (plat->config && plat->config->vtor_override)
        plat->cpu.vtor_default = plat->config->vtor_override;

    /* Minimum host vtable. */
    plat->host.cpu         = &plat->cpu;
    plat->host.gpio        = NULL;
    plat->host.now_ns      = nrf_host_now_ns;
    plat->host.schedule_ns = nrf_host_schedule_ns;
    plat->host.cancel      = nrf_host_cancel;

    /* CLOCK and UART register windows.  The UART page serves both the legacy
     * UART (Contiki) and UARTE EasyDMA (stock Zephyr) register maps. */
    arm_register_io(&plat->cpu, NRF_CLOCK_BASE, NRF_CLOCK_SIZE,
                    nrf_clock_read, nrf_clock_write, &soc->clock);
    soc->uart0.soc     = soc;
    soc->uart0.irq_num = NRF_UARTE_IRQ;
    arm_register_io(&plat->cpu, NRF_UART0_BASE, NRF_UART0_SIZE,
                    nrf_uart_read, nrf_uart_write, &soc->uart0);

    /* RTC0 (Contiki's clock source) + RTC1 (Zephyr's nrf_rtc_timer system
     * clock).  Same model, two instances; each owns its recurring TICK event,
     * keyed by its own base + IRQ.  rtc_start arms the event. */
    soc->rtc0.irq_num = NRF_RTC0_IRQ;
    soc->rtc0.base    = NRF_RTC0_BASE;
    soc->rtc0.soc     = soc;
    cpu_event_t *tev0 = (cpu_event_t *)calloc(1, sizeof(*tev0));
    tev0->callback  = rtc_tick_event_cb;
    tev0->user_data = &soc->rtc0;
    soc->rtc0.tick_event = tev0;
    arm_register_io(&plat->cpu, NRF_RTC0_BASE, NRF_RTC0_SIZE,
                    nrf_rtc_read, nrf_rtc_write, &soc->rtc0);

    soc->rtc1.irq_num = NRF_RTC1_IRQ;
    soc->rtc1.base    = NRF_RTC1_BASE;
    soc->rtc1.soc     = soc;
    cpu_event_t *tev1 = (cpu_event_t *)calloc(1, sizeof(*tev1));
    tev1->callback  = rtc_tick_event_cb;
    tev1->user_data = &soc->rtc1;
    soc->rtc1.tick_event = tev1;
    arm_register_io(&plat->cpu, NRF_RTC1_BASE, NRF_RTC1_SIZE,
                    nrf_rtc_read, nrf_rtc_write, &soc->rtc1);

    /* RADIO — on-chip 2.4 GHz multi-protocol radio. */
    soc->radio.irq_num = NRF_RADIO_IRQ;
    soc->radio.state   = NRF_RADIO_STATE_DISABLED;
    soc->radio.power   = 1;       /* powered up by default */
    arm_register_io(&plat->cpu, NRF_RADIO_BASE, NRF_RADIO_SIZE,
                    nrf_radio_read, nrf_radio_write, soc);

    /* TIMER0..4. Bases per nRF52840 PS table 19. */
    static const uint32_t timer_bases[5] = {
        0x40008000u,  /* TIMER0 */
        0x40009000u,  /* TIMER1 */
        0x4000A000u,  /* TIMER2 */
        0x4001A000u,  /* TIMER3 */
        0x4001B000u   /* TIMER4 */
    };
    for (int i = 0; i < 5; i++) {
        soc->timer[i].base = timer_bases[i];
        soc->timer[i].soc  = soc;
        soc->timer[i].bitmode = 0;          /* 16-bit default */
        arm_register_io(&plat->cpu, timer_bases[i], 0x1000,
                        nrf_timer_read, nrf_timer_write, &soc->timer[i]);
    }

    /* RNG */
    soc->rng.prng_state = 0xDEADBEEF;
    arm_register_io(&plat->cpu, NRF_RNG_BASE, 0x1000,
                    nrf_rng_read, nrf_rng_write, &soc->rng);

    /* FICR — default values; harness patches DEVICEADDR0/1 per node. */
    soc->ficr.deviceaddr0 = 0x00000000;
    soc->ficr.deviceaddr1 = 0x0000F4CE;     /* upper bytes used as MAC OUI fragment */
    arm_register_io(&plat->cpu, NRF_FICR_BASE, 0x1000,
                    nrf_ficr_read, nrf_ficr_write, &soc->ficr);
}

static void nrf52840_soc_destroy(arm_platform_t *plat) {
    nrf52840_soc_t *soc = (nrf52840_soc_t *)plat->soc;
    if (soc) {
        if (soc->rtc0.tick_event) {
            arm_cancel_event(&plat->cpu, (arm_event_t *)soc->rtc0.tick_event);
            free(soc->rtc0.tick_event);
        }
        if (soc->rtc1.tick_event) {
            arm_cancel_event(&plat->cpu, (arm_event_t *)soc->rtc1.tick_event);
            free(soc->rtc1.tick_event);
        }
        free(soc);
    }
    plat->soc = NULL;
}

static void nrf52840_soc_set_console(arm_platform_t *plat,
                                      arm_uart_tx_callback cb, void *user_data) {
    nrf52840_soc_t *soc = (nrf52840_soc_t *)plat->soc;
    soc->uart0.tx_cb   = cb;
    soc->uart0.tx_user = user_data;
}

const arm_soc_ops_t nrf52840_soc_ops = {
    .name        = "nrf52840",
    .init        = nrf52840_soc_init,
    .destroy     = nrf52840_soc_destroy,
    .set_console = nrf52840_soc_set_console,
};
